name: "sng_engine"
platform: "tensorrt_plan"
max_batch_size: 0
input [
 {
    name: "input"
    data_type: TYPE_FP32
    format: FORMAT_NONE
    dims: [1, 3, 32, 128]
  }
]
output {
    name: "output"
    data_type: TYPE_FP32
    dims: [1, 30, 37]
  }

version_policy: { all { }}

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]