name: "usa_engine"
platform: "onnxruntime"
max_batch_size: 0
input [
 {
    name: "actual_input"
    data_type: TYPE_FP32
    format: FORMAT_NONE
    dims: [1, 3, 64, 160]
  }
]
output [{
    name: "output"
    data_type: TYPE_FP32
    dims: [1, 38, 37]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]